tutorials/myLusgsFoam/transonicChannel.coolprop.20MPa/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
  "libfluidThermophysicalModels.so"
  "libmyFoam.so"
);

application     myLusgsFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo 1e3;

rDeltaTSmoothingCoeff 0.01;

functions
{
  #includeFunc "MachNoRG"
  #includeFunc "totalPressureRG"
  #includeFunc "entropyRG"
  #includeFunc "surfaces"
}


// ************************************************************************* //
