tutorials/myLusgsFoam/transonicChannel.coolprop.20MPa/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       CoolProp;
    thermo          CoolProp; 
    equationOfState CoolPropGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    CoolProp
    {
        backend  BICUBIC&HEOS;
        fluid    N2;
    }
}


// ************************************************************************* //
